## Generated SDC file "/run/media/felipe/FFCOSTA/Projetos/verilog_projects/GITHUBPROJECTS/SPACEWIRESYSTEMC/altera_work/spw_jaxa/sdc/jaxa.out.sdc"

## Copyright (C) 2017  Intel Corporation. All rights reserved.
## Your use of Intel Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Intel Program License 
## Subscription Agreement, the Intel Quartus Prime License Agreement,
## the Intel FPGA IP License Agreement, or other applicable license
## agreement, including, without limitation, that your use is for
## the sole purpose of programming logic devices manufactured by
## Intel and sold by Intel or its authorized distributors.  Please
## refer to the applicable agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus Prime"
## VERSION "Version 17.1.1 Internal Build 593 12/11/2017 SJ Lite Edition"

## DATE    "Mon Mar 26 20:35:05 2018"

##
## DEVICE  "5CSEMA4U23C6"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {FPGA_CLK1_50} -period 10.000 -waveform { 0.000 5.000 } [get_ports {FPGA_CLK1_50}]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous }]
create_clock -name {jaxa:u0|jaxa_autoStart:transmitclock|data_out} -period 10.000 -waveform { 0.000 5.000 } [get_registers { jaxa:u0|jaxa_autoStart:transmitclock|data_out }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut }]
create_clock -name {jaxa:u0|jaxa_autoStart:receiveclock|data_out} -period 10.000 -waveform { 0.000 5.000 } [get_registers { jaxa:u0|jaxa_autoStart:receiveclock|data_out }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable }]
create_clock -name {jaxa:u0|jaxa_autoStart:tickin|data_out} -period 10.000 -waveform { 0.000 5.000 } [get_registers { jaxa:u0|jaxa_autoStart:tickin|data_out }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut }]
create_clock -name {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous} -period 10.000 -waveform { 0.000 5.000 } [get_registers { SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous }]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {u0|pll_0|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]} -source [get_pins {u0|pll_0|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|refclkin}] -duty_cycle 50/1 -multiply_by 6 -divide_by 2 -master_clock {FPGA_CLK1_50} [get_pins {u0|pll_0|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]}] 
create_generated_clock -name {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk} -source [get_pins {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50/1 -multiply_by 1 -divide_by 3 -master_clock {u0|pll_0|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]} [get_pins {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] 


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.310  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.310  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.310  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.310  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.310  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.310  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.360  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.280  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.280  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.330  
set_clock_uncertainty -rise_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.330  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.310  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.310  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.360  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.280  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.280  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {FPGA_CLK1_50}]  0.330  
set_clock_uncertainty -fall_from [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {FPGA_CLK1_50}]  0.330  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.290  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.290  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.350  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.330  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.330  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {FPGA_CLK1_50}] -setup 0.310  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {FPGA_CLK1_50}] -hold 0.270  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {FPGA_CLK1_50}] -setup 0.310  
set_clock_uncertainty -rise_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {FPGA_CLK1_50}] -hold 0.270  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEEPAsynchronous}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEOPOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverEEPOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitByteAsynchronous}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:tickin|data_out}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.290  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|iTransmitDataEnable}]  0.290  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iSendStart}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveNullOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveTimeCodeValidOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiverDataValidOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:receiveclock|data_out}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iReceiveFCTOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPReceiverSynchronize:spaceWireReceiver|iDisconnectErrorOut}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {SpaceWireCODECIP:Jaxa_De0_Soc|SpaceWireCODECIPLinkInterface:SpaceWireLinkInterface|SpaceWireCODECIPTransmitter:spaceWireTransmitter|iTransmitEOPAsynchronous}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {jaxa:u0|jaxa_autoStart:transmitclock|data_out}]  0.350  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.330  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {u0|pll_0|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.330  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {FPGA_CLK1_50}] -setup 0.310  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -rise_to [get_clocks {FPGA_CLK1_50}] -hold 0.270  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {FPGA_CLK1_50}] -setup 0.310  
set_clock_uncertainty -fall_from [get_clocks {FPGA_CLK1_50}] -fall_to [get_clocks {FPGA_CLK1_50}] -hold 0.270  


#**************************************************************
# Set Input Delay
#**************************************************************



#**************************************************************
# Set Output Delay
#**************************************************************



#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************

set_false_path -to [get_pins -nocase -compatibility_mode {*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain*|clrn}]


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

